app/Services/PrenotazioneService.php

    public function aggiornaScadute(): int
    {
        // Inizio transazione
        $this->db->transStart();

        // Update con NOW() di MySQL, senza escapare
        $builder = $this->db->table('prenotazioni');
        $builder->where('stato', 'attiva')
                ->where('data_fine <', 'NOW()', false)
                ->update(['stato' => 'completata']);
---
UPDATE `prenotazioni` SET `stato` = 'completata'
WHERE `stato` = 'attiva'
AND data_fine < NOW()