app/Controllers/AdminController.php

    public function indexRisorse()
    {
        $model = new RisorsaModel();
        return view('admin/risorse_list', ['risorse' => $model->findAll()]);
---
SELECT *
FROM `risorse`

    public function listaPrenotazioni()
    {
        $model = new PrenotazioneModel();
        $db = \Config\Database::connect();

        $query = $db->table('prenotazioni')
            ->select('prenotazioni.*, utenti.nome as utente_nome, risorse.nome as risorsa_nome')
            ->join('utenti', 'utenti.id = prenotazioni.utente_id')
            ->join('risorse', 'risorse.id = prenotazioni.risorsa_id')
            ->orderBy('data_inizio', 'DESC')
            ->get();
---
SELECT `prenotazioni`.*, `utenti`.`nome` as `utente_nome`, `risorse`.`nome` as `risorsa_nome`
FROM `prenotazioni`
JOIN `utenti` ON `utenti`.`id` = `prenotazioni`.`utente_id`
JOIN `risorse` ON `risorse`.`id` = `prenotazioni`.`risorsa_id`
ORDER BY `data_inizio` DESC