app/Controllers/HomeController.php

SELECT *
FROM `risorse`
WHERE `tipo` = 'stampante'
---
    public function categoria($tipo)
    {
        $model = new RisorsaModel();
        $data = [
            'tipo' => ucfirst($tipo),
            'risorse' => $model->findAvailableByType($tipo)