app/Controllers/PrenotazioniController.php

SELECT `prenotazioni`.*, `risorse`.`nome` as `risorsa_nome`, `risorse`.`tipo` as `risorsa_tipo`
FROM `prenotazioni`
JOIN `risorse` ON `risorse`.`id` = `prenotazioni`.`risorsa_id`
WHERE `utente_id` = '1'
ORDER BY `data_inizio` DESC
---
    public function miePrenotazioni()
    {
        $model = new PrenotazioneModel();
        $db = \Config\Database::connect();

        $query = $db->table('prenotazioni')
            ->select('prenotazioni.*, risorse.nome as risorsa_nome, risorse.tipo as risorsa_tipo')
            ->join('risorse', 'risorse.id = prenotazioni.risorsa_id')
            ->where('utente_id', session('user')['id'])
            ->orderBy('data_inizio', 'DESC')
            ->get();